In [1]:
import numpy as np
import pandas as pd

In [2]:
url = 'https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv'
file1_df = pd.read_csv(url)

In [3]:
file1_df.head()

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [4]:
# cleaning column names
file1_df.columns = file1_df.columns.str.lower()

In [5]:
file1_df.head()

,customer,st,gender,education,customer lifetime value,income,monthly premium auto,number of open complaints,policy type,vehicle class,total claim amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [6]:
file1_df.rename(columns={'st': 'state'}, inplace=True)

In [7]:
file1_df.head()

,customer,state,gender,education,customer lifetime value,income,monthly premium auto,number of open complaints,policy type,vehicle class,total claim amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [8]:
file1_df.rename(columns={'customer lifetime value': 'customer_lifetime_value', 'monthly premium auto': 'monthly_premium_auto'}, inplace=True)

In [9]:
file1_df.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number of open complaints,policy type,vehicle class,total claim amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [10]:
file1_df.rename(columns={'number of open complaints': 'number_of_open_complaints', 'policy type': 'policy_type', 'vehicle class': 'vehicle_class', 'total claim amount': 'total_claim_amount'}, inplace=True)

In [11]:
file1_df.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [12]:
# cleaning invalid values

In [13]:
unique_gender_values = file1_df['gender'].unique()
print(unique_gender_values)

[nan 'F' 'M' 'Femal' 'Male' 'female']

In [14]:
file1_df['gender'] = file1_df['gender'].replace({
    'Femal': 'F',
    'Male': 'M',
    'female': 'F'
})

In [15]:
unique_gender_values = file1_df['gender'].unique()
print(unique_gender_values)

[nan 'F' 'M']

In [16]:
unique_states_values = file1_df['state'].unique()
print(unique_states_values)

['Washington' 'Arizona' 'Nevada' 'California' 'Oregon' 'Cali' 'AZ' 'WA'
 nan]

In [17]:
file1_df['state'] = file1_df['state'].replace({
    'Cali': 'California',
    'WA': 'Washington',
    'AZ': 'Arizona'
})

In [18]:
unique_state_values = file1_df['state'].unique()
print(unique_state_values)

['Washington' 'Arizona' 'Nevada' 'California' 'Oregon' nan]

In [19]:
unique_education_values = file1_df['education'].unique()
print(unique_education_values)

['Master' 'Bachelor' 'High School or Below' 'College' 'Bachelors' 'Doctor'
 nan]

In [20]:
file1_df['education'] = file1_df['education'].replace({'Bachelors': 'Bachelor'})

In [21]:
unique_education_values = file1_df['education'].unique()
print(unique_education_values)

['Master' 'Bachelor' 'High School or Below' 'College' 'Doctor' nan]

In [22]:
file1_df['customer_lifetime_value'] = file1_df['customer_lifetime_value'].str.replace('%', '')

In [23]:
unique_customer_life_values = file1_df['customer_lifetime_value'].unique()
print(unique_customer_life_values)

[nan '697953.59' '1288743.17' ... '2031499.76' '323912.47' '899704.02']

In [24]:
unique_vehicle_class = file1_df['vehicle_class'].unique()
print(unique_vehicle_class)

['Four-Door Car' 'Two-Door Car' 'SUV' 'Luxury SUV' 'Sports Car'
 'Luxury Car' nan]

In [25]:
file1_df['vehicle_class'] = file1_df['vehicle_class'].replace({'Luxury SUV': 'Luxury', 'Luxury Car': 'Luxury', 'Sports Car': 'Luxury'})

In [26]:
unique_vehicle_class = file1_df['vehicle_class'].unique()
print(unique_vehicle_class)

['Four-Door Car' 'Two-Door Car' 'SUV' 'Luxury' nan]

In [27]:
# formatting data types

In [28]:
data_type = file1_df['customer_lifetime_value'].dtype
print(data_type)

object

In [29]:
file1_df['customer_lifetime_value'] = pd.to_numeric(file1_df['customer_lifetime_value'])

In [30]:
data_type = file1_df['customer_lifetime_value'].dtype
print(data_type)

float64

In [31]:
# dealing with issue for column "number_of_open_complains"

In [32]:
data_type = file1_df['number_of_open_complaints'].dtype
print(data_type)

object

In [33]:
unique_number_of_open_complaints_values = file1_df['number_of_open_complaints'].unique()
print(unique_number_of_open_complaints_values)

['1/0/00' '1/2/00' '1/1/00' '1/3/00' '1/5/00' '1/4/00' nan]

In [36]:

# Define a function to extract the middle value from the complaint string
def extract_middle_complaint(complaint_str):
    complaints = complaint_str.split('/')
    if len(complaints) == 3:
        return int(complaints[1])
    else:
        return 0  # Handle cases where the format is incorrect

# Apply the function to the "Number of open complaints" column
file1_df['number_of_open_complaints'] = file1_df['number_of_open_complaints'].apply(extract_middle_complaint)

# Convert the column to its proper type (numeric)
file1_df['number_of_open_complaints'] = pd.to_numeric(file1_df['number_of_open_complaints'])

AttributeError: 'float' object has no attribute 'split'

In [ ]:
# 4. Dealing with null values

In [40]:
# checking which cell has null value in the column
null_counts = file1_df.isnull()
null_counts

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,False,False,True,False,True,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...
4003,True,True,True,True,True,True,True,True,True,True,True
4004,True,True,True,True,True,True,True,True,True,True,True
4005,True,True,True,True,True,True,True,True,True,True,True
4006,True,True,True,True,True,True,True,True,True,True,True
4007,True,True,True,True,True,True,True,True,True,True,True

In [41]:
# counting null values

null_counts = file1_df.isnull().sum()
null_counts

customer                     2937
state                        2937
gender                       3054
education                    2937
customer_lifetime_value      2940
income                       2937
monthly_premium_auto         2937
number_of_open_complaints    2937
policy_type                  2937
vehicle_class                2937
total_claim_amount           2937
dtype: int64

In [45]:
# dropping null values
file1_df.dropna(axis=0, inplace=True)

In [46]:
# checking for null values again
null_counts = file1_df.isnull()
null_counts

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
1,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False
5,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...
1066,False,False,False,False,False,False,False,False,False,False,False
1067,False,False,False,False,False,False,False,False,False,False,False
1068,False,False,False,False,False,False,False,False,False,False,False
1069,False,False,False,False,False,False,False,False,False,False,False
1070,False,False,False,False,False,False,False,False,False,False,False

In [47]:
null_counts = file1_df.isnull().sum()
null_counts

customer                     0
state                        0
gender                       0
education                    0
customer_lifetime_value      0
income                       0
monthly_premium_auto         0
number_of_open_complaints    0
policy_type                  0
vehicle_class                0
total_claim_amount           0
dtype: int64

In [ ]:
# I implemented drop null function because i wanted to try for now easy methon but for sure it would be better to replace all with mean.

In [51]:
# checking numericl and categorical columns
numerical_cols = file1_df.select_dtypes(include=['number']).columns
categorical_cols = file1_df.select_dtypes(exclude=['number']).columns
numerical_cols

Index(['customer_lifetime_value', 'income', 'monthly_premium_auto',
       'total_claim_amount'],
      dtype='object')

In [52]:
categorical_cols

Index(['customer', 'state', 'gender', 'education', 'number_of_open_complaints',
       'policy_type', 'vehicle_class'],
      dtype='object')

In [55]:
# converting all the numeric variables to integers using applymap.
numerical_columns = ['customer_lifetime_value', 'income', 'monthly_premium_auto', 'total_claim_amount']
file1_df[numerical_columns] = file1_df[numerical_columns].applymap(int)

In [56]:
file1_df.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
1,QZ44356,Arizona,F,Bachelor,697953,0,94,1/0/00,Personal Auto,Four-Door Car,1131
2,AI49188,Nevada,F,Bachelor,1288743,48767,108,1/0/00,Personal Auto,Two-Door Car,566
3,WW63253,California,M,Bachelor,764586,0,106,1/0/00,Corporate Auto,SUV,529
4,GA49547,Washington,M,High School or Below,536307,36357,68,1/0/00,Personal Auto,Four-Door Car,17
5,OC83172,Oregon,F,Bachelor,825629,62902,69,1/0/00,Personal Auto,Two-Door Car,159

In [ ]:
# 5. Dealing with duplicates

In [57]:
file1_df.duplicated()

1       False
2       False
3       False
4       False
5       False
        ...
1066    False
1067    False
1068    False
1069    False
1070    False
Length: 952, dtype: bool

In [58]:
file1_df.duplicated().sum()

0

In [ ]:
# after i used dropna method, there are no duplicates. but if i would have duplicates i would use function file1_df.drop_duplicates(inplace=True)

In [ ]:
# saing go csv file

In [60]:
file_path = 'lab-data-cleaning2.csv'  # Replace 'output_file.csv' with your desired file name and path
file1_df.to_csv(file_path, index=False)